## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: oidc
**Success**: :thumbsup:
```

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

**Step**: run
**Success**: :heavy_multiplication_x:
**Details**: `conftest test -o table /tmp/tmp7931jw3o/infracost/infracost.json --policy /github/workspace/policies/gcp/compute-instance.rego`
```
Error: running test: load: loading policies: load: 1 error occurred during loading: /github/workspace/policies/gcp/compute-instance.rego:11: rego_parse_error: unexpected ident token: expected \n or ; or }
	  "0.0.0.0/0" in ingress.cidr_blocks
	              ^

```
</details>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_security_group.terrateam_security_group will be created
+   resource "aws_security_group" "terrateam_security_group" {
+       arn                    = (known after apply)
+       description            = "Security group with unrestricted SSH access"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "terrateam-security-group"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "terrateam-security-group"
        }
+       tags_all               = {
+           "Name" = "terrateam-security-group"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
